simulationAndResults/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingFoam;

startFrom       startTime;

startTime       0.03999;

stopAt          endTime;

endTime         0.04;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   1e-5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no; //yes;

maxCo           1;

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        enabled         true;
        outputControl   outputTime;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            rho
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }

    probes
    {
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );

        type probes;

        // Name of the directory for probe data
        name probes;

        // Write at same frequency as fields
        outputControl outputTime;
        outputInterval 1;

        // Fields to be probed
        fields
        (
            rho rhoMean
        );

        // Locations to be probed. runTime modifiable!
        probeLocations
        (
            (0.0011 0.0001 0)
	    (0.0033 0.0001 0)
	    (0.0055 0.0001 0)
	    (0.0077 0.0001 0)
	    (0.0099 0.0001 0)
	    (0.0121 0.0001 0)
	    (0.0143 0.0001 0)
	    (0.0165 0.0001 0)
	    (0.0187 0.0001 0)
	    (0.0209 0.0001 0)
	    (0.0231 0.0001 0)
	    (0.0253 0.0001 0)
	    (0.0275 0.0001 0)
	    (0.0297 0.0001 0)
	    (0.0319 0.0001 0)
	    (0.0341 0.0001 0)
	    (0.0363 0.0001 0)
	    (0.0385 0.0001 0)
	    (0.0407 0.0001 0)
	    (0.0429 0.0001 0)
	    (0.0451 0.0001 0)
	    (0.0473 0.0001 0)
	    (0.0495 0.0001 0)
	    (0.0517 0.0001 0)
	    (0.0539 0.0001 0)
	    (0.0561 0.0001 0)
	    (0.0583 0.0001 0)
	    (0.0605 0.0001 0)
	    (0.0627 0.0001 0)
	    (0.0649 0.0001 0)

            (0.0011 0.00017 0)
            (0.0033 0.00044 0)
            (0.0055 0.00071 0)
            (0.0077 0.00098 0)
            (0.0099 0.00125 0)
            (0.0121 0.00152 0)
            (0.0143 0.00179 0)
            (0.0165 0.00206 0)
            (0.0187 0.00233 0)
            (0.0209 0.0026 0)
            (0.0231 0.00287 0)
            (0.0253 0.00314 0)
            (0.0275 0.00341 0)
            (0.0297 0.00368 0)
            (0.0319 0.00395 0)
            (0.0341 0.00422 0)
            (0.0363 0.00449 0)
            (0.0385 0.00476 0)
            (0.0407 0.00503 0)
            (0.0429 0.0053 0)
            (0.0451 0.00557 0)
            (0.0473 0.00584 0)
            (0.0495 0.00611 0)
            (0.0517 0.00638 0)
            (0.0539 0.00665 0)
            (0.0561 0.00692 0)
            (0.0583 0.00719 0)
            (0.0605 0.00746 0)
            (0.0627 0.00773 0)
            (0.0649 0.008 0)



	);
    }

}

// ************************************************************************* //
