simulationAndResults/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-3;

vertices
(
//  Injection plane
(0      0.46316 -0.46316)   // 00
(0      0.77782 -0.77782)   // 01
(0      28.2843 -28.2843)   // 02

(0      28.2843  28.2843)   // 03
(0      0.77782  0.77782)   // 04
(0      0.46316  0.46316)   // 05

(0     -0.46316  0.46316)   // 06
(0     -0.77782  0.77782)   // 07
(0     -28.2843  28.2843)   // 08

(0     -28.2843 -28.2843)   // 09
(0     -0.77782 -0.77782)   // 10
(0     -0.46316 -0.46316)   // 11

// Center Plane #1
(40     0.46316 -0.46316)   // 12
(40     0.77782 -0.77782)   // 13
(40     28.2843 -28.2843)   // 14

(40     28.2843  28.2843)   // 15
(40     0.77782  0.77782)   // 16
(40     0.46316  0.46316)   // 17

(40    -0.46316  0.46316)   // 18
(40    -0.77782  0.77782)   // 19
(40    -28.2843  28.2843)   // 20

(40    -28.2843 -28.2843)   // 21
(40    -0.77782 -0.77782)   // 22
(40    -0.46316 -0.46316)   // 23


// Center Plane #2
(120     0.70711 -0.70711)   // 24
(120     1.97999 -1.97999)   // 25
(120     28.2843 -28.2843)   // 26

(120     28.2843  28.2843)   // 27
(120     1.97999  1.97999)   // 28
(120     0.70711  0.70711)   // 29

(120    -0.70711  0.70711)   // 30
(120    -1.97999  1.97999)   // 31
(120    -28.2843  28.2843)   // 32

(120    -28.2843 -28.2843)   // 33
(120    -1.97999 -1.97999)   // 34
(120    -0.70711 -0.70711)   // 35

// Outlet Plane
(200     0.70711 -0.70711)   // 36
(200     1.97999 -1.97999)   // 37
(200     28.2843 -28.2843)   // 38

(200     28.2843  28.2843)   // 39
(200     1.97999  1.97999)   // 40
(200     0.70711  0.70711)   // 41

(200    -0.70711  0.70711)   // 42
(200    -1.97999  1.97999)   // 43
(200    -28.2843  28.2843)   // 44

(200    -28.2843 -28.2843)   // 45
(200    -1.97999 -1.97999)   // 46
(200    -0.70711 -0.70711)   // 47

);

blocks
(
        // Front Section
	// Center
        hex (0  5  6 11 12 17 18 23) (20 20 45) simpleGrading (1 1 1) 

        // Nitrogen
	hex (5  4  7  6  17 16 19 18) (10 20 45) simpleGrading (0.1 1 1)
	hex (6  7  10 11 18 19 22 23) (10 20 45) simpleGrading (0.1 1 1)
	hex (0  11 10 1  12 23 22 13) (20 10 45) simpleGrading (1 0.1 1)
	hex (1  4  5  0  13 16 17 12) (20 10 45) simpleGrading (1 10 1)

        // Chamber
        hex (4  3  8  7  16 15 20 19) (10 20 45) simpleGrading (314 1 1)
        hex (7  8  9  10 19 20 21 22) (10 20 45) simpleGrading (314 1 1)
        hex (1  10 9  2  13 22 21 14) (20 10 45) simpleGrading (1 314 1)
        hex (2  3  4  1  14 15 16 13) (20 10 45) simpleGrading (1 0.0031847 1)

        // Middle Section
        // Center
        hex (12 17 18 23 24 29 30 35) (20 20 45) simpleGrading (1 1 5)
        
        // Nitrogen
        hex (17 16 19 18 29 28 31 30) (10 20 45) edgeGrading  (0.1 0.1 1 1 1 1 1 1 5 5 5 5)
        hex (18 19 22 23 30 31 34 35) (10 20 45) edgeGrading  (0.1 0.1 1 1 1 1 1 1 5 5 5 5)
        hex (12 23 22 13 24 35 34 25) (20 10 45) edgeGrading  (1 1 1 1 0.1 0.1 1 1 5 5 5 5)
        hex (13 16 17 12 25 28 29 24) (20 10 45) edgeGrading  (1 1 1 1 10 10 1 1 5 5 5 5)

        // Chamber
        hex (16 15 20 19 28 27 32 31) (10 20 45) edgeGrading  (314 314 8.295 8.295 1 1 1 1 5 5 5 5)
        hex (19 20 21 22 31 32 33 34) (10 20 45) edgeGrading  (314 314 8.295 8.295 1 1 1 1 5 5 5 5)
        hex (13 22 21 14 25 34 33 26) (20 10 45) edgeGrading  (1 1 1 1 314 314 8.295 8.295 5 5 5 5)
        hex (14 15 16 13 26 27 28 25) (20 10 45) edgeGrading  (1 1 1 1 0.0031847 0.0031847 0.1206 0.1206 5 5 5 5)

        // Rear Section
        // Center
        hex (24 29 30 35 36 41 42 47) (20 20 25) simpleGrading  (1 1 3)

        // Nitrogen
        hex (29 28 31 30 41 40 43 42) (10 20 25) simpleGrading  (1 1 3)
        hex (30 31 34 35 42 43 46 47) (10 20 25) simpleGrading  (1 1 3)
        hex (24 35 34 25 36 47 46 37) (20 10 25) simpleGrading  (1 1 3)
        hex (25 28 29 24 37 40 41 36) (20 10 25) simpleGrading  (1 1 3)

        // Chamber
        hex (28 27 32 31 40 39 44 43) (10 20 25) edgeGrading  (8.295 8.295 4.924 4.924 1 1 1 1 3 3 3 3)
        hex (31 32 33 34 43 44 45 46) (10 20 25) edgeGrading  (8.295 8.295 4.924 4.924 1 1 1 1 3 3 3 3)
        hex (25 34 33 26 37 46 45 38) (20 10 25) edgeGrading  (1 1 1 1 8.295 8.295 4.924 4.924 3 3 3 3)
        hex (26 27 28 25 38 39 40 37) (20 10 25) edgeGrading  (1 1 1 1 0.1206 0.1206 0.203 0.203 3 3 3 3)

);

edges
(
        // Injection Plane
        // Center
	arc 0  5  (0   0.55  0)
	arc 5  6  (0   0     0.55)
	arc 6  11 (0  -0.55  0)
	arc 11 0  (0   0    -0.55)

        // Nitrogen
        arc 1  4  (0   1.1  0)
        arc 4  7  (0   0    1.1)
        arc 7  10 (0  -1.1  0)
        arc 10 1  (0   0   -1.1)

        // Chamber
        arc 2  3  (0   40   0)
        arc 3  8  (0   0    40)
        arc 8  9  (0  -40   0)
        arc 9  2  (0   0   -40)

        // Center Plane
        // Center
        arc 12 17 (40  0.55 0)
        arc 17 18 (40  0    0.55)
        arc 18 23 (40 -0.55 0)
        arc 23 12 (40  0   -0.55)

        // Nitrogen
        arc 13 16 (40  1.1  0)
        arc 16 19 (40  0    1.1)
        arc 19 22 (40 -1.1  0)
        arc 22 13 (40  0   -1.1)

        // Chamber
        arc 14 15 (40  40   0)
        arc 15 20 (40  0    40)
        arc 20 21 (40 -40   0)
        arc 21 14 (40  0   -40)

        // Center Plane #2
        // Center
        arc 24 29 (120  0.84  0)
        arc 29 30 (120  0    0.84)
        arc 30 35 (120 -0.84  0)
        arc 35 24 (120  0   -0.84)

        // Nitrogen
        arc 25 28 (120  2.8  0)
        arc 28 31 (120  0    2.8)
        arc 31 34 (120 -2.8  0)
        arc 34 25 (120  0   -2.8)

        // Chamber
        arc 26 27 (120  40   0)
        arc 27 32 (120  0    40)
        arc 32 33 (120 -40   0)
        arc 33 26 (120  0   -40)

        // Outlet Plane
        // Center
        arc 36 41 (200  0.84  0)
        arc 41 42 (200  0  0.84)
        arc 42 47 (200 -0.84  0)
        arc 47 36 (200  0 -0.84)

        // Nitrogen
        arc 37 40 (200  2.8  0)
        arc 40 43 (200  0    2.8)
        arc 43 46 (200 -2.8  0)
        arc 46 37 (200  0   -2.8)

        // Chamber
        arc 38 39 (200  40   0)
        arc 39 44 (200  0    40)
        arc 44 45 (200 -40   0)
        arc 45 38 (200  0   -40)

);

boundary
(
	inlet
	{
	type patch;
	faces
	   (
		(0  5  6  11)

		(0  1  4  5 )
		(5  4  7  6)
		(6  7  10 11)
		(11 10 1  0 )
	   );
	}

        outlet
        {
        type    patch;
        faces
           (
                (41 36 47 42)

                (40 37 36 41)
                (37 46 47 36)
                (46 43 42 47)
                (43 40 41 42)

                (39 38 37 40)
                (38 45 46 37)
                (45 44 43 46)
                (44 39 40 43)
           );
        }

        faceplate
        {
        type    wall;
        faces
           (
                (1  2  3  4 )
                (4  3  8  7 )
                (7  8  9  10)
                (10 9  2  1 )
           );
        }

        walls
        {
        type    wall;
        faces
           (
                (2  14 15 3 )
                (3  15 20 8 )
                (8  20 21 9 )
                (9  21 14 2 )
                 
                (14 26 27 15)
                (15 27 32 20)
                (20 32 33 21)
                (21 33 26 14)

                (26 38 39 27)
                (27 39 44 32)
                (32 44 45 33)
                (33 45 38 26)
           );
        }

);

mergePatchPairs
(
);

// ************************************************************************* //

