simulationAndResults/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 3970000;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            fixedValue;
	value		$internalField;
    }
    outlet
    {
/*        type            totalPressure;
        p0              $internalField;
        U               U;
        phi             phi;
        rho             none;
        psi             none;
        gamma           1.4;*/
	type		fixedValue;
	value		$internalField;
    }
    faceplate
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
